CREATE TABLE trip (
  trip_id INT PRIMARY KEY AUTO_INCREMENT,
  name VARCHAR(50),
  city VARCHAR(30),
  per_diem DECIMAL(8, 2),
  date_first DATETIME,
  date_last DATETIME
);

INSERT INTO trip (trip_id, name, city, per_diem, date_first, date_last)
VALUES 
  (NULL, 'Баранов П.Е.', 'Москва', 700.00, '2020-01-12', '2020-01-17'),
  (NULL, 'Абрамова К.А.', 'Владивосток', 450.00, '2020-01-14', '2020-01-27'),
  (NULL, 'Семенов И.В.', 'Москва', 700.00, '2020-01-23', '2020-01-31'),
  (NULL, 'Ильиных Г.Р.', 'Владивосток', 450.00, '2020-01-12', '2020-02-02'),
  (NULL, 'Колесов С.П.', 'Москва', 700.00, '2020-02-01', '2020-02-06'),
  (NULL, 'Баранов П.Е.', 'Москва', 700.00, '2020-02-14', '2020-02-22'),
  (NULL, 'Абрамова К.А.', 'Владивосток', 450.00, '2020-07-02', '2020-07-13'),
  (NULL, 'Баранов П.Е.', 'Воронеж', 450.00, '2020-07-19', '2020-07-23');

       
       
